In [1]:
import pandas as pd

# pandas series

In [5]:
ser = pd.Series(data=[100,'foo',300,400,500], index=[666, 'bob', 'nancy', 'dan', 'eric'])
ser

666      100
bob      foo
nancy    300
dan      400
eric     500
dtype: object

In [4]:
ser.index

Index(['tom', 'bob', 'nancy', 'dan', 'eric'], dtype='object')

In [8]:
ser['bob']

'foo'

In [9]:
ser[['bob', 'nancy']]

bob      foo
nancy    300
dtype: object

In [10]:
ser[[1,3]]

bob    foo
dan    400
dtype: object

In [11]:
ser.iloc[2]

300

In [12]:
'bob' in ser

True

In [13]:
ser * 2

666         200
bob      foofoo
nancy       600
dan         800
eric       1000
dtype: object

In [14]:
ser[['nancy', 'eric']] ** 2

nancy     90000
eric     250000
dtype: object

# pandas data frames

In [16]:
d = {'col_one': pd.Series([100,200,300], ['apple', 'orange', 'banana']),
    'col_two' : pd.Series([111,222,333,444], ['apple', 'ball', 'clock', 'water'])}

In [17]:
df = pd.DataFrame(d)
print(df)

        col_one  col_two
apple     100.0    111.0
ball        NaN    222.0
banana    300.0      NaN
clock       NaN    333.0
orange    200.0      NaN
water       NaN    444.0

In [18]:
df.index

Index(['apple', 'ball', 'banana', 'clock', 'orange', 'water'], dtype='object')

In [19]:
df.columns

Index(['col_one', 'col_two'], dtype='object')

In [20]:
pd.DataFrame(d, index = ['apple', 'ball', 'orange'])

        col_one  col_two
apple     100.0    111.0
ball        NaN    222.0
orange    200.0      NaN

In [22]:
pd.DataFrame(d, index = ['apple', 'ball', 'orange'], columns = ['col_two', 'five'])

        col_two five
apple     111.0  NaN
ball      222.0  NaN
orange      NaN  NaN

## create data frame from list of python dict

In [23]:
data = [{'alex': 1, 'joe': 2}, {'ema': 5, 'dora': 10, 'alice': 20}]

In [25]:
df2 = pd.DataFrame(data)
print(df2)

   alex  joe  ema  dora  alice
0   1.0  2.0  NaN   NaN    NaN
1   NaN  NaN  5.0  10.0   20.0

In [27]:
df3 = pd.DataFrame(data, index=['row1', 'row2'])
df3

      alex  joe  ema  dora  alice
row1   1.0  2.0  NaN   NaN    NaN
row2   NaN  NaN  5.0  10.0   20.0

In [30]:
df4 = pd.DataFrame(data, columns=['joe','dora', 'alice'])
df4

   joe  dora  alice
0  2.0   NaN    NaN
1  NaN  10.0   20.0

In [36]:
df['col_one']
# df['apple']
'apple' in df

False

In [43]:
df['col_three'] = df['col_one'] + df['col_two']
df

        col_one  col_two   flag  col_three
apple     100.0    111.0  False      211.0
ball        NaN    222.0  False        NaN
banana    300.0      NaN  False        NaN
clock       NaN    333.0   True        NaN
orange    200.0      NaN  False        NaN
water       NaN    444.0   True        NaN

In [38]:
df['flag'] = df['col_two'] > 300
df

        col_one  col_two  col_three   flag
apple     100.0    111.0      211.0  False
ball        NaN    222.0        NaN  False
banana    300.0      NaN        NaN  False
clock       NaN    333.0        NaN   True
orange    200.0      NaN        NaN  False
water       NaN    444.0        NaN   True

In [44]:
three = df.pop('col_three')
three

apple     211.0
ball        NaN
banana      NaN
clock       NaN
orange      NaN
water       NaN
Name: col_three, dtype: float64

In [45]:
del df['flag']
df

        col_one  col_two
apple     100.0    111.0
ball        NaN    222.0
banana    300.0      NaN
clock       NaN    333.0
orange    200.0      NaN
water       NaN    444.0

In [49]:
df.pop('copy_of_one')
df.insert(0, 'copy_of_one', df['col_one'])
df

        copy_of_one  col_one  col_two
apple         100.0    100.0    111.0
ball            NaN      NaN    222.0
banana        300.0    300.0      NaN
clock           NaN      NaN    333.0
orange        200.0    200.0      NaN
water           NaN      NaN    444.0

In [54]:
df['upper_one'] = df['col_one'][:2]
df

        copy_of_one  col_one  col_two  upper_one
apple         100.0    100.0    111.0      100.0
ball            NaN      NaN    222.0        NaN
banana        300.0    300.0      NaN        NaN
clock           NaN      NaN    333.0        NaN
orange        200.0    200.0      NaN        NaN
water           NaN      NaN    444.0        NaN

# Case study

In [56]:
!cat ./movielens/movies.csv | wc -l

    9743

In [58]:
movies = pd.read_csv('./movielens/movies.csv', sep=',')
movies.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy